# Неизвестный водила совершил ДТП и скрылся с места происшествия. Полиция опрашивает свидетелей.
# Каждый из них говорит, что запомнил какие-то буквы и цифры номера. Но при этом свидетели не помнят
# порядок этих цифр и букв. Полиция хочет проверить несколько подозреваемых авто.
# Будем говорить, что номер согласуется с показаниями свидетеля, если все символы, которые назвал 
# свидетель, присутствует в этом номере (не важно, сколько раз). 

# Выпишите номера авто, которые согласуются с максимальным кол-вом свидетелй. Если таких номеров несколько, 
# то выведите их в том же порядке, в котором они были заданы на входе. 

# Будем смотреть, является ли показания свидетеля подмножеством номера подозреваемого авто.
# Если это так, увеличим счётчик сведителей для данного авто на один
